In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [12]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [14]:
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [16]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [18]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [19]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [21]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [22]:
df.index.names = ['Groups', 'Num']

In [23]:
df

                   A         B
Groups Num
G1     1    0.147027 -0.479448
       2    0.558769  1.024810
       3   -0.925874  1.862864
G2     1   -1.133817  0.610478
       2    0.386030  2.084019
       3   -0.376519  0.230336

In [26]:
df.iloc[2][0]

-0.925874258809907

In [27]:
df.loc['G1'].loc[3]['A']

-0.925874258809907

In [28]:
df.xs(2,level ='Num')

               A         B
Groups
G1      0.558769  1.024810
G2      0.386030  2.084019

In [29]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [30]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
cd

/Users/kapiva

In [32]:
ls

Applications/   Downloads/      Music/          employers.csv
Desktop/        Library/        Pictures/       flyerNIVER.png
Documents/      Movies/         Public/

In [33]:
cd Documents/GitHub/

/Users/kapiva/Documents/GitHub

In [34]:
ls

20180420.ipynb                    captalys_exercicio_analytics.csv
20180421_numpy.ipynb              kfpiva.github.io/
20180423_pandas.ipynb             myfile.txt
Aula20180410.ipynb                pslog.txt
Complete-Python-3-Bootcamp/       testfile.csv
aula20180409.ipynb

In [90]:
df100 = 0

In [91]:
df100

0

In [50]:
byano = df100.groupby('ano')

In [53]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [62]:
df100['uf'].value_counts()

RS    340
SP    272
SC    200
RJ    163
BA    154
MG    142
GO    117
MA    110
PE     92
RN     85
TO     80
PB     79
AL     67
RO     63
SE     42
PA     29
PR      7
Name: uf, dtype: int64

In [70]:
def virgula(x):
    return float(x.replace(',','.'))

df100['anual'] = df100['faturamento'].apply(virgula)

In [78]:
df100.pivot_table(values='mensal',columns=['uf'] )

uf,AL,BA,GO,MA,MG,PA,PB,PE,PR,RJ,RN,RO,RS,SC,SE,SP,TO
mensal,691.892256,942.491283,355.909943,991.258562,360.328774,358.028302,3074.982548,225.041269,1393.372756,20914.755015,11085.876832,575.056137,914.744598,900.100871,444.344758,1207.867102,4953.179427

In [79]:
cd

/Users/kapiva

In [81]:
ls

Applications/   Downloads/      Music/          employers.csv
Desktop/        Library/        Pictures/       flyerNIVER.png
Documents/      Movies/         Public/

In [82]:
cd Documents/GitHub/

/Users/kapiva/Documents/GitHub

In [86]:
invites = pd.read_excel('Teste_antigo.xlsx',sheet_name='invites_modificada')

In [87]:
bank = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [95]:
bankdf = bank[0]